In [ ]:
#1st Excercise

In [6]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [22]:
inputs = df.drop('salary_more_then_100k',axis='columns')
target = df['salary_more_then_100k']

In [23]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [24]:
from sklearn.preprocessing import LabelEncoder

In [25]:
le_company =  LabelEncoder()
le_job =  LabelEncoder()
le_degree = LabelEncoder()

In [26]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_company.fit_transform(inputs['job'])
inputs['degree_n'] = le_company.fit_transform(inputs['degree'])
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [27]:
inputs_n = inputs.drop(['company','job','degree'],axis='columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [28]:
from sklearn import tree

In [30]:
model = tree.DecisionTreeClassifier()

In [31]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [33]:
model.score(inputs_n,target)

1.0

In [38]:
#2nd Excercise

In [39]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/Exercise/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Fare','Embarked'],axis='columns')
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [54]:
inputs = df.drop(["Survived"],axis='columns')
target = df.Survived

In [55]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [67]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [68]:
inputs.head()

   Pclass  Sex   Age
0       3    1  22.0
1       1    2  38.0
2       3    2  26.0
3       1    2  35.0
4       3    1  35.0

In [69]:
from sklearn.model_selection import train_test_split

In [70]:
X_train , X_test , y_train ,y_test = train_test_split(inputs,target,test_size=0.2)

In [71]:
len(X_train)

712

In [72]:
len(X_test)

179

In [73]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [75]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [76]:
model.score(X_test,y_test)

0.7486033519553073